FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПричиныОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПричиныОбращений</Name>
			<Comment>Причины обращений</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Comment>Причина обращения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПричиныОбращений/Ext/ManagerModule.bsl
// Формирование причины обращения в виде строки
//
// Параметры
//  СтараяПричинаОбращения  - <Строка> - Старая причина обращения
//                 <продолжение описания параметра>
//  НоваяПричинаОбращения  - <ПричиныОбращений.Ссылка>,<Массив> - Новая причина обращения
//
// Возвращаемое значение:
//   <Строка>   - Новая причина обращения
//
Функция СформироватьПричинуОбращения(СтараяПричинаОбращения="",НоваяПричинаОбращения) Экспорт
	Если ТипЗнч(НоваяПричинаОбращения)=Тип("СправочникСсылка.ПричиныОбращений") Тогда
		МассивПричинОбращения=Новый Массив;
		МассивПричинОбращения.Добавить(НоваяПричинаОбращения);
	ИначеЕсли ТипЗнч(НоваяПричинаОбращения)=Тип("Массив") Тогда
		МассивПричинОбращения=НоваяПричинаОбращения;
	Иначе
		Возврат СтараяПричинаОбращения;
	КонецЕсли;
	Если МассивПричинОбращения.Количество()=0 Тогда
		Возврат СтараяПричинаОбращения;
	КонецЕсли; 
	НоваяПричинаОбращения=СокрЛП(СтараяПричинаОбращения);
	Для Сч=0 По МассивПричинОбращения.Количество()-1 Цикл
		ПричинаОбращения=МассивПричинОбращения[Сч];
		ПричинаОбращенияАртикул=СокрЛП(ПричинаОбращения.Артикул);
		ПричинаОбращенияПричинаОбращения=СокрЛП(ПричинаОбращения.ПричинаОбращения);
		Если НоваяПричинаОбращения <> "" Тогда 
			НоваяПричинаОбращения=НоваяПричинаОбращения+Символы.ВК;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ПричинаОбращенияАртикул) Тогда
			НоваяПричинаОбращения=НоваяПричинаОбращения+"["+ПричинаОбращенияАртикул+"] ";
		КонецЕсли;
		НоваяПричинаОбращения=НоваяПричинаОбращения+ПричинаОбращенияПричинаОбращения;
	КонецЦикла;
	Возврат НоваяПричинаОбращения;
КонецФункции // СформироватьПричинуОбращения()
